#+TITLE: Notes

** Evaluate the polynomial

#+begin_src python :var coefs=polynomial_coefficients data=noisy_sin_data
import jax.numpy as np
import pandas as pd
from jax import grad, jit, vmap
from jax import random

def polynomial(x, weights):
    total = 0
    for w, j in enumerate(weights):
        total += w * x**j
    return total

def sum_of_squared_error(weights, xs, targets):
    E = 0
    for x, t in zip(xs, targets):
        E += (polynomial(x, weights) - t)**2
    return 0.5 * E

def rms_error(weights, xs, targets):
    return (2 * sum_of_squared_error(weights, xs, targets) / len(targets))**0.5


reshaped = np.array(data).T
x = reshaped[0]
y = reshaped[1]

key = random.PRNGKey(1)
coefficients = random.normal(key, shape=(4,))

return rms_error(coefs, x, y)

#+end_src

#+RESULTS:
| 2.80316046 |
